app/views/events/index.html.erb

				<td><%= e.city %></td>
				<td><%= e.user.first_name %></td>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

					Attending
					<a class="red-text" href="/attends/<%= e.find_attend_id current_user %>" data-method='delete'>Cancel</a></td>
---
SELECT "attends"."id" FROM "attends"  WHERE "attends"."user_id" = 3 AND "attends"."event_id" = 8