app/views/events/show.html.erb

<h3> <%= @event.name %> </h3>
<p> <b>Host:</b> <%= @event.user.first_name %> </p>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]

<p> <b>Location:</b> <%= @event.city %>, <%= @event.state %></p>
<p> <b>People who are joining the event:</b> <%= @event.attends.count %></p>
---
SELECT "attends".* FROM "attends"  WHERE "attends"."event_id" = ?  [["event_id", 8]]
SELECT COUNT(*) FROM "attends"  WHERE "attends"."event_id" = ?  [["event_id", 8]]

		<% @comment.each do |comment| %>
		<%= comment.user.first_name %> says: <%= comment.comment %>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."event_id" = ?  [["event_id", 8]]