app/controllers/attends_controller.rb

INSERT INTO "attends" ("created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2016-01-20 22:46:04.749616"], ["event_id", 8], ["updated_at", "2016-01-20 22:46:04.749616"], ["user_id", 3]]
---
	def create
		attending = Attend.new(attend_params)
		if attending.save

SELECT  "attends".* FROM "attends"  WHERE "attends"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "attends" WHERE "attends"."id" = ?  [["id", 1]]
---
	def destroy
		a = Attend.find(params[:id])
		if a.destroy