app/controllers/comments_controller.rb

INSERT INTO "comments" ("comment", "created_at", "event_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "woooo"], ["created_at", "2016-01-20 17:57:55.569420"], ["event_id", 8], ["updated_at", "2016-01-20 17:57:55.569420"], ["user_id", 2]]
---
  def create
  	comment = Comment.new(comments_params)
  	if comment.save