app/controllers/events_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "events".* FROM "events"  WHERE "events"."state" = 'CA' LIMIT 1
SELECT "events".* FROM "events"
SELECT "attends".* FROM "attends"  WHERE "attends"."event_id" = ?  [["event_id", 8]]
---
  def index
  	user = User.find(session[:user_id])
  	@events_same = Event.all.where(state:user.state)
  	@events_outside = Event.all.where.not(state:user.state)
    @attend = Attend.all

INSERT INTO "events" ("city", "created_at", "date", "name", "state", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["city", "Afadsfdf"], ["created_at", "2016-01-20 00:16:34.205249"], ["date", "2016-01-23"], ["name", "adfdaf"], ["state", "AK"], ["updated_at", "2016-01-20 00:16:34.205249"], ["user_id", 1]]
---
  def create
  	event = Event.new(event_params)
  	if event.save

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "events" SET "name" = ?, "updated_at" = ? WHERE "events"."id" = 8  [["name", "Having fun NO FUN"], ["updated_at", "2016-01-20 22:11:42.561844"]]
---
  def update
    event = Event.find(params[:id])
    if event.update(event_params)

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 9]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 9]]
---
  def destroy
    event = Event.find(params[:id])
    if event.destroy