app/controllers/users_controller.rb

	def create
		user = User.new(user_params)
		if user.save
---
INSERT INTO "users" ("city", "created_at", "email", "first_name", "last_name", "password_digest", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def update
		user = User.find(params[:id])
		if user.update(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = 5  [["first_name", "Jackie"], ["updated_at", "2016-02-04 03:28:26.200922"]]